import * as yup from 'yup';

export const buyTrue = yup.object({
    name: yup.string().min(2, "Ім'я повинно містити принаймні 4 символи").matches(/^[a-zA-Zа-яА-ЯґҐєЄіІїЇ' ]+$/, 'Імʼя повинно містити тільки літери').required("Будь ласка введіть Ім'я"),
    surname: yup.string().min(4, "Прізвище повинно містити принаймні 4 символи").matches(/^[a-zA-Zа-яА-ЯґҐєЄіІїЇ' ]+$/, 'Імʼя повинно містити тільки літери').required("Будь ласка введіть Призвіще"),
    age: yup.number().min(18, 'Введіть коректний вік(вам має бути 18 або більше)').required("Будь ласка введіть Вік"),
    address: yup.string().min(8).required("Будь ласка введіть Адресу"),
    phone: yup.string().min(8).matches(/^\D?(\d{3})\D?\D?(\d{3})\D?(\d{2})\D?(\d{2})$/, "Будь ласка, введіть правильний номер телефону").required("Будь ласка, введіть номер телефону"),
})